---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.WallFoundationType
source: html/07306d71-63e9-5df1-a2e4-d410e8277617.htm
---
# WallFoundationType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.